Repository: unicolored/gilles.dev
Catalog: src/tmp_locale/messages.*.xlf
Languages: fr

source: 👉 I will be back soon!
fr: 👉 Bientôt de retour !

source: Welcome
fr: Bienvenue

source: About
fr: A propos

source: Home sweet Home
fr: Bienvenue à la maison

source: Hi! Salut ! Ciao!
fr: Salut ! Hi! Ciao!

source: I'm Gilles Hoarau
fr: Je suis Gilles Hoarau

source: For {{ this.year - 2006 }} years now, I've been working on various development and graphic design projects.
fr: Depuis {{ this.year - 2006 }} ans, je travaille sur des projets variés de développement et de graphisme.

source: From creative brainstorming to final delivery, I continue to learn every day.
fr: De l'idée à la livraison finale, je continue d'apprendre chaque jour.

source: My adventure began with writing a book to teach photo manipulation, edited by MicroApplication, sold around 20,000 copies.
fr: Mon aventure a commencé par l'écriture d'un livre dédié à la manipulation de photos, édité par Micro Application, vendu à près de 20000 exemplaires.

source: In 2006, I co-create an advertising agency, where I used my self-taught skills professionally to produce creative media.
fr: En 2006, je m'associais à une agence de communication, où j'ai pu utiliser professionnellement mes compétences d'autodidacte pour produire des supports de communication.

source: In 2014, I joined Groupe PSA’s Digital Factory to facilitate Innovation committees and develop proof of concepts on new trends: Internet-Of-Things, Real-time 3D, Progressive Web Apps, Chatbots & Vocal Assistants.
fr: En 2014, j'ai intégré la Digital Factory de Groupe PSA pour animer des comités Innovation et développer des démonstrations de faisabilité sur les nouvelles tendances : Internet des Objets, 3D en temps réel, Progressive Web Apps, Chatbots & Assistants vocaux.

source: My colleagues often refer to me as a “Jack of all trades”.
fr: Mes collègues m'ont alors surnommé "le couteau suisse".

source: From 2021 to 2023, I led the development of 2 projects for the customers of Stellantis: an AI-driven vehicle Search Engine and an Order Tracking module connected with the supply chain management system.
fr: De 2021 à 2023, j'ai supervisé le développement de 2 projets pour les clients de Stellantis : un moteur de recherche de véhicule propulsé par l'IA et un module de suivi de commande connecté aux systèmes de la chaîne logistique.

source: Overall, I appreciated working with teams from around the world, exposing me to a wealth of different cultures and perspectives. The inspiring leadership I experienced pushed me to grow and develop in ways I never imagined.
fr: J'ai apprécié collaborer avec des équipes du monde entier, ce qui m'a permis de découvrir une riche diversité de cultures et de points de vue. Le leadership inspirant dont j'ai bénéficié m'a permis de me dépasser et de m'épanouir de manière inattendue.

source: Starting in 2024
fr: À partir de 2024

source: I'm now focusing my development efforts specifically on web apps that leverage cutting-edge generative AI technologies.
fr: Je concentre mes efforts de développement vers les applications exploitant les dernières technologies d'IA générative.

source: I'm open to discuss web development projects.
fr: Je suis disponible pour discuter de projets de développement web.

source: Drop me a line anytime, or book a call!
fr: Laissez-moi un message, ou appelez-moi !

source: Hobbies
fr: Loisirs

source: I like to wake up early, learn every day, and think about what makes life beautiful
fr: J'apprécie me lever tôt, apprendre chaque jour, ainsi que penser à ce qui rend la vie belle

source: Surrounded by my 4 cats and 4 chickens, I relax by learning chess (<em>where I aim to win!</em>), piano (<em>molto piano!</em>), and Italian (<em>Oggi, ho voglia mangiare un gelato</em> 🍦).
fr: Entouré de mes 4 chats et 4 poules, je me détends en apprenant les échecs (<em>où je vise la victoire !</em>), le piano (<em>très doucement !</em>), et l'italien (<em>Oggi, ho voglia mangiare un gelato</em> 🍦).

source: Call me
fr: Appelez-moi

source: Whether you have a creative venture or an everyday challenge, I would be happy to help.
fr: Que vous ayez un projet créatif ou un défi quotidien, je serai heureux de vous aider.

source: Book a call
fr: Planifiez un appel

source: Leave me a message
fr: Laissez-moi un message

source: Copied!
fr: Copié !

source: Hi, I'm Gilles<br>≈ a developer
fr: Gilles Hoarau<br>≈ développeur

source: I'm a self-taught creator of web apps, imagery, and 3D experiences
fr: Je suis un autodidacte, créateur d'applications web, d'images, et d'expériences 3D

source: My developer toolkit
fr: Mon kit développeur

source: Throughout my career, I've tackled every stage of web development and deployment, from brewing the coffee ☕️ to scaling cloud infrastructure, writing tons of code, testing it thoroughly, building containers in CI/CD pipelines, and celebrating successful launches.
fr: J'ai participé à toutes les étapes de développement et de déploiement de sites web tout au long de ma carrière. Ce qui comprend la préparation du café ☕️, la mise à l'échelle d'infrastructures cloud, beaucoup de code et des tests. Mais aussi la création de conteneurs sur des chaînes CI/CD et la célébration des lancements.

source: <strong>Front-end</strong>: NX, Angular, NestJS, Firebase <br><strong>Back-end</strong>: Symfony, Docker, MongoDB, Redis <br><strong>Bonus skill</strong>: Three.js
fr: Front-end: NX, Angular, NestJS, Firebase<br> Back-end: Symfony, Docker, MongoDB, Redis<br> Bonus: ThreeJS

source: Creative media design
fr: Création graphique

source: My creative journey began with traditional drawing and sketching. Soon, I was exploring the world of computer graphics, playing with photo editing and 3D modeling. Later, I honed my skills in print design and branding before diving headfirst into web design. Back then, smartphones hadn't even conquered the world yet.
fr: Mon aventure créative a commencé par le dessin traditionnel. J'ai vite été attiré par l'infographie, la retouche photo et la modélisation 3D. Puis je me suis concentré sur l'imprimerie et la création d'identité visuelle avant de me spécialiser en web design. C'était avant que les smartphones aient conquis le monde.

source: <strong>My design toolbox</strong>: Photoshop, Illustrator, Figma <br><strong>Bonus tools</strong>: Blender and generative AI for image creation!
fr: Ma boîte à outils : Photoshop, Illustrator, Figma.<br> Bonus : Blender et la génération d'image avec l'IA !

source: Developer
fr: Développeur

source: Meet Gilles, a self-taught creator of web apps, imagery, and 3D experiences. Discover his developer toolkit, creative media design skills, and more.
fr: Rencontrez Gilles, un autodidacte créant des applications web, de l'imagerie et des expériences 3D. Découvrez ses outils de développement, ses compétences en design de médias créatifs, et bien plus encore.

source: Learn more about Gilles Hoarau, a self-taught web developer and designer with over 15 years of experience. Discover his journey from writing a book on photo manipulation to developing AI-driven web apps, his work in diverse development and graphic design projects, and his hobbies.
fr: Découvrez Gilles Hoarau, un autodidacte spécialisé en développement web et design, avec plus de 15 ans d'expérience. Explorez son parcours, de l'écriture d'un livre sur la manipulation d'images à la création d'applications web alimentées par l'IA, en passant par des projets variés de développement et de design graphique, et ses loisirs.

source: Get in touch with Gilles Hoarau, a seasoned web developer and designer. Call directly, send an email, or book a call to discuss creative ventures or everyday challenges. Gilles is ready to help with your project needs.
fr: Contactez Gilles Hoarau, un développeur et designer web expérimenté. Appelez-le directement, envoyez-lui un email ou planifiez un appel pour discuter de projets créatifs ou de défis quotidiens. Gilles est prêt à vous aider dans vos projets.
